src/cf/InformationRegisters/КодыТоваровPLUНаОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровPLUНаОборудовании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодТовараSKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТовараPLU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КодыТоваровSKU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровSKU</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстройствоРаспознавания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблачнаяККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Несертифицируемое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>АПК:93 одинаковое представление и для объекта и для списка</Comment>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ОприходованиеЗапасов</xr:Item>
				<xr:Item>Document.СборкаЗапасов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьНовыеЦеныПоверхУстановленных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДействующуюЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЗависимыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНедействительныеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьОтклонениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьХарактеристикамБезЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНовуюЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНаценку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетИзВидаЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйНовыйФормат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаСтарая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/ОфлайнОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОфлайнОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбработчикОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключенияОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОбменДаннымиПодключаемоеОборудованиеOfflineСобытия/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьИзмененияСправочника(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОбменСПодключаемымОборудованиемOffline") Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("СправочникОбъект.Номенклатура") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК Код,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Номенклатура = &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОфлайнОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Номенклатура = &Значение");
		
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.ХарактеристикиНоменклатуры") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК Код,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Характеристика = &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОфлайнОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Характеристика = &Значение");
		
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.ПартииНоменклатуры") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК Код,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОфлайнОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Партия = &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОфлайнОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Партия = &Значение");
		
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.ЕдиницыИзмерения") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК Код,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.ЕдиницаИзмерения = &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОфлайнОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.ЕдиницаИзмерения = &Значение");
	
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.КатегорииНоменклатуры") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК Код,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Номенклатура.КатегорияНоменклатуры = &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОфлайнОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Номенклатура.КатегорияНоменклатуры = &Значение");
		
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.ПодключаемоеОборудование") Тогда
		
		Если  ЗначениеЗаполнено(Источник.УзелИнформационнойБазы)
			И ЗначениеЗаполнено(Источник.ПравилоОбмена)
			И Источник.ПравилоОбмена <> Источник.Ссылка.ПравилоОбмена
			И (Источник.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.УдалитьККМОфлайн
			   ИЛИ Источник.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток) Тогда
			
			ПланыОбмена.УдалитьРегистрациюИзменений(Источник.УзелИнформационнойБазы);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена,
			|	КодыТоваровPLUНаОборудовании.Код           КАК Код,
			|	&УзелИнформационнойБазы                                   КАК УзелИнформационнойБазы
			|ИЗ
			|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
			|ГДЕ
			|	КодыТоваровPLUНаОборудовании.ПравилоОбмена = &ПравилоОбмена");
			
			Запрос.УстановитьПараметр("ПравилоОбмена", Источник.ПравилоОбмена);
			Запрос.УстановитьПараметр("УзелИнформационнойБазы", Источник.УзелИнформационнойБазы);
			
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Значение",             Источник.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Набор = РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		
		Набор.Отбор.ПравилоОбмена.Значение = Выборка.ПравилоОбмена;
		Набор.Отбор.ПравилоОбмена.Использование = Истина;
		
		Набор.Отбор.КодТовараPLU.Значение = Выборка.Код;
		Набор.Отбор.КодТовараPLU.Использование = Истина;
		
		ПланыОбмена.ЗарегистрироватьИзменения(Выборка.УзелИнформационнойБазы, Набор);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОбменСПодключаемымОборудованиемOffline") Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		|	ЗаказПокупателя.КассаККМ КАК КассаККМ,
		|	ЗаказПокупателя.КассаККМ.ОфлайнОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.КассаККМ <> ЗНАЧЕНИЕ(Справочник.КассыККМ.ПустаяСсылка)
		|	И ЗаказПокупателя.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если ЗначениеЗаполнено(Выборка.УзелИнформационнойБазы) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Выборка.УзелИнформационнойБазы, Выборка.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
		ИначеЕсли ТипИсточника = Тип("ДокументОбъект.УстановкаЦенНоменклатуры") Тогда
		
		Запрос = Новый Запрос(
		
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	УстановкаЦенНоменклатурыТовары.Характеристика КАК Характеристика,
		|	УстановкаЦенНоменклатурыТовары.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ПереченьТоваров
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Запасы КАК УстановкаЦенНоменклатурыТовары
		|ГДЕ
		|	УстановкаЦенНоменклатурыТовары.Ссылка = &Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КодыТоваровSKU.SKU КАК SKU
		|ПОМЕСТИТЬ КодыSKU
		|ИЗ
		|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|ГДЕ
		|	(КодыТоваровSKU.Номенклатура, КодыТоваровSKU.Характеристика) В
		|			(ВЫБРАТЬ
		|				ПереченьТоваров.Номенклатура,
		|				ПереченьТоваров.Характеристика
		|			ИЗ
		|				ПереченьТоваров КАК ПереченьТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена
		|ПОМЕСТИТЬ ИспользуемыеПравилаОбмена
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодыSKU КАК КодыSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыSKU.SKU
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК КодТовараPLU,
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодыSKU КАК КодыSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыSKU.SKU
		|
		|СГРУППИРОВАТЬ ПО
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИспользуемыеПравилаОбмена КАК ИспользуемыеПравилаОбмена
		|		ПО ПодключаемоеОборудование.ПравилоОбмена = ИспользуемыеПравилаОбмена.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСПодключаемымОборудованиемOffline КАК ОбменСПодключаемымОборудованием
		|		ПО ПодключаемоеОборудование.УзелИнформационнойБазы = ОбменСПодключаемымОборудованием.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОфлайнОборудование.УзелИнформационнойБазы
		|ИЗ
		|	Справочник.ОфлайнОборудование КАК ОфлайнОборудование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИспользуемыеПравилаОбмена КАК ИспользуемыеПравилаОбмена
		|		ПО ОфлайнОборудование.ПравилоОбмена = ИспользуемыеПравилаОбмена.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСПодключаемымОборудованиемOffline КАК ОбменСПодключаемымОборудованием
		|		ПО ОфлайнОборудование.УзелИнформационнойБазы = ОбменСПодключаемымОборудованием.Ссылка");
		
		Запрос.УстановитьПараметр("Значение", Источник.Ссылка);
		
		Результат = Запрос.ВыполнитьПакет();
		УзлыДляЗаписи = Результат[4].Выгрузить();
		ДанныеДляРегистрации = Результат[3].Выгрузить();
		
		МассивУзлов = УзлыДляЗаписи.ВыгрузитьКолонку("УзелИнформационнойБазы");
		
		Набор = РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьНаборЗаписей();
		Для Каждого Товар Из ДанныеДляРегистрации Цикл
			Набор.Отбор.ПравилоОбмена.Значение = Товар.ПравилоОбмена;
			Набор.Отбор.ПравилоОбмена.Использование = Истина;
			
			Набор.Отбор.КодТовараPLU.Значение = Товар.КодТовараPLU;
			Набор.Отбор.КодТовараPLU.Использование = Истина;
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Набор);
		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияРегистраСведений(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОбменСПодключаемымОборудованиемOffline") Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК Код,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (КодыТоваровSKU.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
		|			И (КодыТоваровSKU.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
		|			И (КодыТоваровSKU.Партия = ШтрихкодыНоменклатуры.Партия)
		|			И (КодыТоваровSKU.ЕдиницаИзмерения = ШтрихкодыНоменклатуры.ЕдиницаИзмерения)
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И ШтрихкодыНоменклатуры.Штрихкод = &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОфлайнОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (КодыТоваровSKU.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
		|			И (КодыТоваровSKU.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
		|			И (КодыТоваровSKU.Партия = ШтрихкодыНоменклатуры.Партия)
		|			И (КодыТоваровSKU.ЕдиницаИзмерения = ШтрихкодыНоменклатуры.ЕдиницаИзмерения)
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И ШтрихкодыНоменклатуры.Штрихкод = &Значение");
		
		Запрос.УстановитьПараметр("Значение", Источник.Отбор.Штрихкод.Значение);
		
	ИначеЕсли ТипИсточника = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена КАК ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU КАК Код,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Номенклатура = &Значение
		|	И КодыТоваровPLUНаОборудовании.ПравилоОбмена.ВидЦеныНоменклатуры = &ВидЦен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыТоваровPLUНаОборудовании.ПравилоОбмена,
		|	КодыТоваровPLUНаОборудовании.КодТовараPLU,
		|	ПодключаемоеОборудование.УзелИнформационнойБазы
		|ИЗ
		|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОфлайнОборудование КАК ПодключаемоеОборудование
		|		ПО КодыТоваровPLUНаОборудовании.ПравилоОбмена = ПодключаемоеОборудование.ПравилоОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|		ПО КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU
		|ГДЕ
		|	ПодключаемоеОборудование.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка)
		|	И КодыТоваровSKU.Номенклатура = &Значение
		|	И КодыТоваровPLUНаОборудовании.ПравилоОбмена.ВидЦеныНоменклатуры = &ВидЦен");
		
		Запрос.УстановитьПараметр("Значение", Источник.Отбор.Номенклатура.Значение);
		Запрос.УстановитьПараметр("ВидЦен", Источник.Отбор.ВидЦен.Значение);
	
	Иначе
		Возврат;
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Набор = РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		
		Набор.Отбор.ПравилоОбмена.Значение = Выборка.ПравилоОбмена;
		Набор.Отбор.ПравилоОбмена.Использование = Истина;
		
		Набор.Отбор.КодТовараPLU.Значение = Выборка.Код;
		Набор.Отбор.КодТовараPLU.Использование = Истина;
		
		ПланыОбмена.ЗарегистрироватьИзменения(Выборка.УзелИнформационнойБазы, Набор);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияРегистраНакопленияДляОбменаСОборудованиемOfflineПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменСПодключаемымОборудованиемOffline", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура СоздатьУзелОбменаСПодключаемымОборудованиемOffline(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.УзелИнформационнойБазы) Тогда
		Если ТипЗнч(Источник) = Тип("СправочникОбъект.ПодключаемоеОборудование") Тогда
			Если Источник.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
				Источник.УзелИнформационнойБазы = ПолучитьУзелРИБ(Источник);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ОфлайнОборудование") Тогда
			Источник.УзелИнформационнойБазы = ПолучитьУзелРИБ(Источник);
		КонецЕсли;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ИзмененоПравилоОбмена", Источник.ПравилоОбмена <> Источник.Ссылка.ПравилоОбмена);
	
КонецПроцедуры

Процедура ОчиститьУзелОбменаСПодключаемымОборудованиемOffline(Источник, ОбъектКопирования) Экспорт
	
	Источник.УзелИнформационнойБазы = ПланыОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка();
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияПриСменеПравилаОбменаПодключаемогоОборудования(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.ПодключаемоеОборудование") И Источник.ДополнительныеСвойства.ИзмененоПравилоОбмена Тогда
		Если Источник.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
			УстановитьПривилегированныйРежим(Истина);
			ПланыОбмена.ЗарегистрироватьИзменения(Источник.УзелИнформационнойБазы, Метаданные.РегистрыСведений.КодыТоваровPLUНаОборудовании);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ОфлайнОборудование") И Источник.ДополнительныеСвойства.ИзмененоПравилоОбмена Тогда
		УстановитьПривилегированныйРежим(Истина);
		ПланыОбмена.ЗарегистрироватьИзменения(Источник.УзелИнформационнойБазы, Метаданные.РегистрыСведений.КодыТоваровPLUНаОборудовании);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция создаёт узел для данного экземпляра подключаемого оборудования и возвращает ссылку на него
// Применяется перед записью элемента справочника Подключаемое оборудование
//
Функция ПолучитьУзелРИБ(ПодключаемоеОборудованиеОбъект)
	
	УзелОбъект = ПланыОбмена.ОбменСПодключаемымОборудованиемOffline.СоздатьУзел();
	УзелОбъект.УстановитьНовыйКод();
	УзелОбъект.Наименование = ПодключаемоеОборудованиеОбъект.Наименование;
	УзелОбъект.Записать();
	
	Возврат УзелОбъект.Ссылка;
	
КонецФункции

Процедура УдалитьУзелОбменаСПодключаемымОборудованиемOffline(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Источник.УзелИнформационнойБазы) Тогда
		УзелИнформационнойБазыСсылка = Источник.УзелИнформационнойБазы;
		УзелИнформационнойБазы       = УзелИнформационнойБазыСсылка.ПолучитьОбъект();
		УзелИнформационнойБазы.Удалить();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
#КонецОбласти
